BR Plan
Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_BR_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_BR_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_BR_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_BR_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_BR_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_BR_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_conversations_chat_transfer_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_conversations_chat_transfer_workflow_sid" {
        id             = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/conversations_chat_transfer_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/conversations_chat_transfer_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/conversations_chat_transfer_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC98b66f5541f81de7050c7254cf5c96c9/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ expression           = "helpline=='SaferNet' or isContactlessTask==true OR channelType=='web' OR twilioNumber=='messenger:175804982467404' OR channelType=='facebook'" -> "helpline=='SaferNet' or isContactlessTask==true OR channelType IN ['web', 'messenger'] OR twilioNumber=='messenger:175804982467404'"
                            # (2 unchanged attributes hidden)
                        },
                        {
                            expression           = "channelType=='web' AND e2eTestMode=='true'"
                            filter_friendly_name = "E2E Test"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQ77483eaab7c89b520e231317792ec016"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS82e00f7fb2df7966a28438f5205d8291/WWf59e09aff15e87081a0f85827fcdd8c2"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["queue_transfers"] will be created
  + resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      + assignment_callback_url          = (known after apply)
      + configuration                    = jsonencode(
            {
              + task_routing = {
                  + filters = [
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ77483eaab7c89b520e231317792ec016'"
                          + filter_friendly_name = "e2e_test"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ77483eaab7c89b520e231317792ec016"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ3649b94f7b2944244948b1b384fbedfc'"
                          + filter_friendly_name = "master"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ3649b94f7b2944244948b1b384fbedfc"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQf9aeabcb2d8a0d14abcc5601239b458b'"
                          + filter_friendly_name = "survey"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ3649b94f7b2944244948b1b384fbedfc"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      + fallback_assignment_callback_url = (known after apply)
      + friendly_name                    = "Queue Transfers Workflow"
      + id                               = (known after apply)
      + re_evaluate_tasks                = (known after apply)
      + sid                              = (known after apply)
      + task_reservation_timeout         = (known after apply)
      + workspace_sid                    = "WS82e00f7fb2df7966a28438f5205d8291"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQf9aeabcb2d8a0d14abcc5601239b458b"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS82e00f7fb2df7966a28438f5205d8291/WWbae3afa7da0d58bd4e4fa90f334f4623"
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WWf59e09aff15e87081a0f85827fcdd8c2" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master          = "WWf59e09aff15e87081a0f85827fcdd8c2" -> (known after apply)
      + queue_transfers = (known after apply)
      ~ survey          = "WWbae3afa7da0d58bd4e4fa90f334f4623" -> (known after apply)
    }